import { ref } from 'vue';

export default () => {
	const list = ref([
		{
			name: '自治区人民医院',
			address: '新疆维吾尔自治区乌鲁木齐市天池路91号',
			phone: '0991-8564427',
			doctors: [
				{
					name: '刘晖',
					title: '医疗保健中心主任',
					phone: '0991-8562797',
				},
				{
					name: '向红',
					title: '医疗保健中心副主任',
					phone: '0991-8563818',
				},
			],
		},
		{
			name: '新疆医科大学第一附属医院',
			address: '新疆维吾尔自治区乌鲁木齐市新市区鲤鱼山南路137号',
			phone: '0991-4361415',
			doctors: [
				{
					name: '张莉',
					title: '保健中心主任',
					phone: '0991-4361415',
				},
				{
					name: '王玉玲',
					title: '保健中心副主任',
					phone: '0991-4361415',
				},
				{
					name: '周梅',
					title: '保健中心副主任',
					phone: '0991-4326835',
				},
			],
		},
		{
			name: '新疆医科大学附属中医医院',
			address: '新疆维吾尔自治区乌鲁木齐市沙依巴克区黄河路116号',
			phone: '0991-5813577',
			doctors: [
				{
					name: '吕书勤',
					title: '保健科主任',
					phone: '0991-5813577',
				},
				{
					name: '马骏骐',
					title: '保健科副主任',
					phone: '0991-5813577',
				},
				{
					name: '徐雪莲',
					title: '保健科副主任',
					phone: '0991-5813577',
				},
			],
		},
		{
			name: '新疆医科大学第二附属医院',
			address: '乌鲁木齐水磨沟区南湖东路北二巷38号',
			phone: '0991-4609151',
			doctors: [
				{
					name: '穆清爽',
					title: '保健科主任',
					phone: '0991-4609151',
				},
			],
		},
		{
			name: '新疆医科大学附属肿瘤医院',
			address: '新疆乌鲁木齐市新市区苏州东街789号',
			phone: '0991-7968089',
			doctors: [
				{
					name: '赵艳',
					title: '保健科科长',
					phone: '0991-7968089',
				},
			],
		},
		{
			name: '自治区维吾尔医医院(自治区第二人医院)',
			// address: '新疆乌鲁木齐市新市区苏州东街789号',
			phone: '0991-6296628',
			doctors: [
				{
					name: '木巴热克.麦麦提',
					title: '保健办主任',
					phone: '0991-6296628',
				},
			],
		},
		{
			name: '自治区职业病医院（自治区第三人民医）',
			// address: '新疆乌鲁木齐市新市区苏州东街789号',
			phone: '0991-7673676',
			doctors: [
				{
					name: '何东奎',
					title: '保健科主任',
					phone: '0991-7673676',
				},
				{
					name: '潘颖',
					title: '保健医生',
					phone: '0991-7673676',
				},
			],
		},
		{
			name: '乌鲁木齐市口腔医院',
			// address: '新疆乌鲁木齐市新市区苏州东街789号',
			phone: '0991-2821320',
			doctors: [
				{
					name: '葛子',
					title: '医务科副主任',
					phone: '0991-2821320',
				},
			],
		},
		{
			name: '新疆医科大学第六附属医院',
			// address: '新疆乌鲁木齐市新市区苏州东街789号',
			phone: '0991-2630571',
			doctors: [
				{
					name: '张冰',
					title: '保健科负责人',
					phone: '0991-2630571',
				},
			],
		},
	]);
	return {
		hospitalList: list,
	};
};
